In [2]:
import sqlite3
import pandas as pd

In [3]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [4]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [5]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [18]:
pd.read_sql(
    '''
    SELECT CHAS, AVG(CRIM) as avg_CRIM, AVG(ZN) as avg_ZN, AVG(INDUS) as avg_INDUS, AVG(NOX) as avg_NOX
  FROM boston GROUP BY CHAS;
    ''',
    con,
)

   CHAS  avg_CRIM     avg_ZN  avg_INDUS   avg_NOX
0   0.0  3.723215  11.634820  11.019193  0.551817
1   1.0  1.851670   7.714286  12.719143  0.593426

In [7]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [7]:
tasks+=1
pd.read_sql(
    '''
    SELECT CRIM, COUNT() as "CRIM empty values", ZN, COUNT() as "ZN empty values", INDUS, COUNT() as "INDUS empty values", CHAS, COUNT() as "CHAS empty values", NOX, COUNT(*) as "NOX empty values" FROM boston WHERE CRIM IS NULL OR ZN IS NULL OR INDUS IS NULL OR CHAS IS NULL OR NOX IS NULL;
    ''',
    con,
)

,CRIM,CRIM empty values,ZN,ZN empty values,INDUS,INDUS empty values,CHAS,CHAS empty values,NOX,NOX empty values
0,None,0,None,0,None,0,None,0,None,0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [8]:
tasks+=1
pd.read_sql(
    '''
    SELECT CRIM, COUNT(DISTINCT CRIM) as "CRIM unique values", ZN, COUNT(DISTINCT ZN) as "ZN unique values", INDUS, COUNT(DISTINCT INDUS) as "INDUS unique values", CHAS, COUNT(DISTINCT CHAS) as "CHAS unique values", NOX, COUNT(DISTINCT NOX) as "NOX unique values" FROM boston;
    ''',
    con,
)

,CRIM,CRIM unique values,ZN,ZN unique values,INDUS,INDUS unique values,CHAS,CHAS unique values,NOX,NOX unique values
0,0.00632,504,18.0,26,2.31,76,0.0,2,0.538,81

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [10]:
tasks+=1
pd.read_sql(
    '''
    WITH t1 AS (
  SELECT
    column_name,
    MIN(column_value) AS min_value,
    AVG(column_value) AS avg_value
  FROM (
    SELECT
      'CRIM' AS column_name,
      CRIM AS column_value
    FROM boston
    UNION ALL
    SELECT
      'ZN' AS column_name,
      ZN AS column_value
    FROM boston
    UNION ALL
    SELECT
      'INDUS' AS column_name,
      INDUS AS column_value
    FROM boston
    UNION ALL
    SELECT
      'CHAS' AS column_name,
      CHAS AS column_value
    FROM boston
    UNION ALL
    SELECT
      'NOX' AS column_name,
      NOX AS column_value
    FROM boston
  )
  GROUP BY
    column_name
),
t2 AS (
  SELECT
    column_name,
    AVG(column_value) AS median_value
  FROM (
    SELECT
      column_name,
      column_value,
      ROW_NUMBER() OVER (PARTITION BY column_name ORDER BY column_value) AS row_num,
      COUNT(*) OVER (PARTITION BY column_name) AS total_rows
    FROM (
      SELECT
        column_name,
        column_value
      FROM (
        SELECT
          'CRIM' AS column_name,
          CRIM AS column_value
        FROM boston
        UNION ALL
        SELECT
          'ZN' AS column_name,
          ZN AS column_value
        FROM boston
        UNION ALL
        SELECT
          'INDUS' AS column_name,
          INDUS AS column_value
        FROM boston
        UNION ALL
        SELECT
          'CHAS' AS column_name,
          CHAS AS column_value
        FROM boston
        UNION ALL
        SELECT
          'NOX' AS column_name,
          NOX AS column_value
        FROM boston
      )
    )
  )
  WHERE
    row_num = total_rows / 2 + 1
    OR row_num = total_rows / 2
  GROUP BY
    column_name
)
SELECT
  t1.column_name
FROM
  t1
  JOIN t2 ON t1.column_name = t2.column_name
WHERE
  t1.avg_value = t2.median_value
  AND t1.min_value = t2.median_value;
    ''',
    con,
)

Empty DataFrame
Columns: [column_name]
Index: []

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [9]:
tasks+=1
pd.read_sql(
    '''
    WITH most_expensive AS (
SELECT RM, MEDV
FROM boston
ORDER BY MEDV DESC
LIMIT 1
), cheapest_25 AS (
SELECT RM, MEDV
FROM boston
ORDER BY MEDV
LIMIT 25
), cheapest_50 AS (
SELECT RM, MEDV
FROM boston
ORDER BY MEDV
LIMIT 50
), cheapest_100 AS (
SELECT RM, MEDV
FROM boston
ORDER BY MEDV
LIMIT 100
), cheapest_200 AS (
SELECT RM, MEDV
FROM boston
ORDER BY MEDV
LIMIT 200
), cheapest_300 AS (
SELECT RM, MEDV
FROM boston
ORDER BY MEDV
LIMIT 300
)

SELECT 25 as "number of houses", avg(cheapest_25.RM) as "average rooms in cheapest 25", avg(most_expensive.RM) as "average rooms in most expensive", (avg(most_expensive.RM) - avg(cheapest_25.RM)) as "difference"
FROM most_expensive, cheapest_25
UNION
SELECT 50 as "number of houses", avg(cheapest_50.RM) as "average rooms in cheapest 50", avg(most_expensive.RM) as "average rooms in most expensive", (avg(most_expensive.RM) - avg(cheapest_50.RM)) as "difference"
FROM most_expensive, cheapest_50
UNION
SELECT 100 as "number of houses", avg(cheapest_100.RM) as "average rooms in cheapest 100", avg(most_expensive.RM) as "average rooms in most expensive", (avg(most_expensive.RM) - avg(cheapest_100.RM)) as "difference"
FROM most_expensive, cheapest_100
UNION
SELECT 200 as "number of houses", avg(cheapest_200.RM) as "average rooms in cheapest 200", avg(most_expensive.RM) as "average rooms in most expensive", (avg(most_expensive.RM) - avg(cheapest_200.RM)) as "difference"
FROM most_expensive, cheapest_200
UNION
SELECT 300 as "number of houses", avg(cheapest_300.RM) as "average rooms in cheapest 300", avg(most_expensive.RM) as "average rooms in most expensive", (avg(most_expensive.RM) - avg(cheapest_300.RM)) as "difference"
FROM most_expensive, cheapest_300;
    ''',
    con,
)

,number of houses,average rooms in cheapest 25,average rooms in most expensive,difference
0,25,5.747840,7.489,1.741160
1,50,5.753240,7.489,1.735760
2,100,5.887120,7.489,1.601880
3,200,5.911705,7.489,1.577295
4,300,5.972227,7.489,1.516773

–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤–ª–∏—è–µ—Ç –Ω–∞ —Ü–µ–Ω—É, –Ω–æ –Ω–µ–∑–Ω–∞—á–∏—Ç–µ–ª—å–Ω–æ

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [11]:
tasks+=1
pd.read_sql(
    '''
    SELECT LSTAT, MEDV, RANK() OVER (ORDER BY LSTAT DESC)
FROM boston
ORDER BY MEDV DESC
    ''',
    con,
)

     LSTAT  MEDV  RANK() OVER (ORDER BY LSTAT DESC)
0     9.53  50.0                                304
1     8.88  50.0                                326
2     7.44  50.0                                365
3     5.12  50.0                                440
4     4.63  50.0                                457
..     ...   ...                                ...
501  23.97   7.0                                 43
502  29.97   6.3                                 13
503  26.77   5.6                                 27
504  30.59   5.0                                 12
505  22.98   5.0                                 52

[506 rows x 3 columns]

–ß–µ–º –≤—ã—à–µ —Å—Ç–æ–∏–º–æ—Å—Ç—å - —Ç–µ–º –º–µ–Ω—å—à–µ –≥–æ–ª—ã—Ç—å–±—ã

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [12]:
tasks+=1
pd.read_sql(
    '''
    SELECT
    (CASE WHEN CHAS = 0 THEN 'Not bordering the river' ELSE 'Bordering the river' END) as "Bordering",
    AVG(MEDV) as "Average Price"
    FROM boston
    GROUP BY CHAS;
    ''',
    con,
)

                 Bordering  Average Price
0  Not bordering the river      22.093843
1      Bordering the river      28.440000

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [20]:
tasks+=1
pd.read_sql(
    '''
    WITH cte AS (
  SELECT CHAS, AVG(CRIM) as avg_CRIM, AVG(ZN) as avg_ZN, AVG(INDUS) as avg_INDUS, AVG(NOX) as avg_NOX
  FROM boston
  GROUP BY CHAS
)
SELECT 
  (CASE WHEN cte.avg_CRIM > cte2.avg_CRIM THEN 'CRIM' ELSE NULL END) as column_name
  ,(CASE WHEN cte.avg_ZN > cte2.avg_ZN THEN 'ZN' ELSE NULL END) as column_name
  ,(CASE WHEN cte.avg_INDUS > cte2.avg_INDUS THEN 'INDUS' ELSE NULL END) as column_name
  ,(CASE WHEN cte.avg_NOX > cte2.avg_NOX THEN 'NOX' ELSE NULL END) as column_name
FROM cte
JOIN cte cte2
ON cte.CHAS <> cte2.CHAS AND cte.CHAS = 1
    ''',
    con,
)

  column_name column_name column_name column_name
0        None        None       INDUS         NOX

–¢—è–≥–æ—Ç–µ–Ω–∏–µ –±–∏–∑–Ω–µ—Å–∞ –∫ —Ä–µ–∫–µ –º–æ–∂–µ—Ç –±—ã—Ç—å –æ–±—ä—è—Å–Ω–µ–Ω–æ –±–æ–ª–µ–µ —É–¥–æ–±–Ω—ã–º–∏ —Ç—Ä–∞–Ω—Å–ø–æ—Ä—Ç–Ω—ã–º–∏ –ø—É—Ç—è–º–∏ –∏ –∫–∞–∫ —Å–ª–µ–¥—Å—Ç–≤–∏–µ, –ø–æ–≤—ã—à–µ–Ω–∏–µ —É—Ä–æ–≤–Ω—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞

–í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX).8.  –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [48]:
tasks+=1
pd.read_sql(
    '''
  WITH cte AS (
  SELECT 
    INDUS, 
    NOX,
    NTILE(10) OVER (ORDER BY INDUS) AS indus_tile, 
    NTILE(10) OVER (ORDER BY NOX) AS nox_tile
  FROM boston
)
SELECT 
  10 * indus_tile AS percentile, 
  AVG(INDUS) AS indus_value, 
  AVG(NOX) AS nox_value
FROM cte
GROUP BY indus_tile
ORDER BY percentile;
        ''',
    con,
)

   percentile  indus_value  nox_value
0          10     2.016078   0.438378
1          20     3.645294   0.494129
2          30     5.246275   0.448235
3          40     6.471765   0.470839
4          50     8.256078   0.531510
5          60    10.749216   0.515176
6          70    17.245800   0.564920
7          80    18.100000   0.684880
8          90    18.307200   0.714620
9         100    21.938800   0.692860

In [ ]:
### –í —Ü–µ–ª–æ–º –Ω–∞–ª–∏—á–∏–µ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ(–º–± –ø—Ä–æ–∏–∑–≤–æ–¥—Å—Ç–≤–µ–Ω–Ω–æ–≥–æ) –±–∏–∑–Ω–µ—Å–∞ —Å–≤—è–∑–∞–Ω–æ —Å –ø–æ–≤—ã—à–µ–Ω–∏–µ —É—Ä–æ–≤–Ω—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ –≤ –≤–æ–∑–¥—É—Ö–µ

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [ ]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')